Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-38-42.tmx
Source language: bo
Languages: en

source: །རྒྱལ་བའི་ཆོས་སྤྲིན་མངོན་པར་ཆར་འབབ་པ། །ཀུན་ཀྱང་མ་ལུས་ཡོངས་སུ་འཛིན་པ་བྱེད།
en: That falls from the clouds of the Dharma of the jinas.

source: །ཕྱོགས་བཅུ་མ་ལུས་ཀུན་ཏུ་དེ་དག་འདོང་།
en: “They go into every direction without exception,

source: །རྒྱལ་བའི་དཀྱིལ་འཁོར་ཀུན་གྱི་སྤྱན་སྔར་འབབ།
en: Arriving in the presence of the fields of the jinas.

source: །གཟུགས་མང་རྣམ་པ་སྣ་ཚོགས་བསྟན་གནས་ཤིང་།
en: They manifest a variety of a multitude of forms,

source: །རྣམ་འཕྲུལ་སྣ་ཚོགས་ཉེ་བར་སྟོན་པ་བྱེད།
en: And they manifest a variety of miracles. “They fill all directions with thousands of forms

source: །ཁ་དོག་མཐའ་ཡས་རང་གི་ལུས་གཟུགས་ཀྱིས། །ཕྱོགས་རྣམས་ཐམས་ཅད་རྣམ་པ་སྟོང་དུ་འགེངས།
en: With their physical bodies that have infinite colors.

source: །དེ་དག་ལུས་གཅིག་ལས་ཀྱང་གཟུགས་ཀྱི་རྣམས།
en: They can manifest from the form of a single body

source: །མཐའ་དང་དབུས་མྱེད་རྣམ་པར་སྟོན་པར་བྱེད།
en: Infinite aspects, vast without end or middle.

source: །བ་སྤུ་རེ་རེའི་སྒོ་ནས་གྲངས་མྱེད་པའི། །འོད་གཟེར་མང་པོ་རྒྱ་མཚོ་དེ་དག་འགྱེད།
en: “They radiate an ocean of innumerable Light rays from each and every pore,

source: །སྐྱེ་དགུ་ཉོན་མོངས་མྱེ་ཡིས་གདུངས་པ་དག །སྣ་ཚོགས་ཐབས་ཀྱིས་རབ་ཏུ་ཞི་བར་བྱེད།
en: And through a variety of methods they extinguish The pain from the fire of the kleśas within beings.

source: །འདི་ལ་གནས་པ་ལུས་སྤྲུལ་སྤྲིན་མང་བ།
en: “While they remain in one place, clouds of emanated bodies

source: །བ་སྤུ་རེ་རེའི་སྒོ་ནས་འགྱེད་བྱེད་ཅིང་།
en: Are radiated from each and every pore,

source: །ངོ་མཚར་རྨད་ཀྱིས་ཕྱོགས་ཀུན་རྒྱས་བཀང་ནས།
en: Filling all directions with marvelous wonders

source: །ཆོས་ཆུའི་ཆར་གྱིས་སེམས་ཅན་རྣམ་པར་འདུལ།
en: And guiding beings with the rain of the water of the Dharma.

source: །ཚུལ་འཇུག་འདི་ནི་བསམ་གྱིས་མྱི་ཁྱབ་གཟུགས།
en: “This way of entering is that of inconceivable form.

source: །རྒྱལ་སྲས་ཀུན་གྱི་གནས་སུ་གྱུར་པ་སྟེ།
en: It is the support for all the progeny of the jinas.

source: །དེ་ལ་གནས་ཤིང་ཕྱི་མཐའི་བསྐལ་པར་ཡང་།
en: Remaining in this, they practice the conduct

source: །ཞིང་རྣམས་ཀུན་ཏུ་སྤྱད་པ་རབ་ཏུ་སྤྱོད།
en: Within all realms until the last of future kalpas.

source: །བསམ་པ་ཇི་བཞིན་ཆོས་རྣམས་སྟོན་བྱེད་ཅིང་།
en: “They teach the Dharma in accordance with aspirations,

source: །དེ་དག་ལྟ་བའི་དྲ་བ་རྣམ་པར་བཟློག །མཐོ་རིས་མྱ་ངན་འདས་ལ་སེམས་ཅན་འགོད།
en: And they repel the nets that are wrong views. They establish beings in the higher existences and nirvāṇa,

source: །ཐམས་ཅད་མཁྱེན་པའི་ས་ཡང་རྣམ་པར་སྟོན། །འཇིག་རྟེན་སྐྱེ་གནས་ཐམས་ཅད་མ་ལུས་པར།
en: And they teach the level of omniscience. “They teach the Dharma according to aspirations

source: །ཁ་དོག་མཐའ་ཡས་ལུས་མང་བསམ་ཡས་པ།
en: With endless colors and countless bodies,

source: །བསམ་པ་བཞིན་དུ་ཆོས་རྣམས་རྗོདབྱེད་དེ།
en: With all kinds of birth and worlds without exception,

source: །དེ་དག་སེམས་ཅན་ཀུན་གྱི་གཟུགས་བརྙན་གཟུགས།
en: With bodies that are the images of the bodies of all beings.

source: །འདི་དང་གཞན་དག་ཚད་ལས་འདས་པ་ཡི། །ཡོན་ཏན་རྒྱ་མཚོ་ཞིང་མང་རྒྱ་མཚོ་ཡི།
en: “These and also a measureless ocean of other qualities,

source: །རྡུལ་ཕྲན་རབ་སྙེད་བསམ་གྱིས་མྱི་ཁྱབ་པ།
en: As numerous as the atoms in an ocean of realms And beyond conception, are attained

source: །རྣམ་ཐར་ཞི་བ་འདི་ལྡན་ཐོབ་པར་འགྱུར།
en: By those who have this liberation, this peace.

source: །རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དགེ་བའི་རྩ་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་འདི་ཤེས་པར་ཟད་ན། ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་ལམ་གྱི་རྒྱུད་ལས་འདས་པ། འཇིག་རྟེན་གྱི་སྐྱེ་གནས་ཐམས་ཅད་དུ་གཟུགས་བརྙན་རབ་ཏུ་འབྱུང་བ། འཇིག་རྟེན་གྱི་ཤེས་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ། ཤེས་བྱའི་སྒྲིབ་པ་ཐམས་ཅད་ཀྱི་རི་རྣམ་པར་འཐོར་བ་ལ་བརྩོན་པ། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་དང་། མཚན་ཉིད་རབ་ཏུ་རྟོགས་པ་ཉོན་མོངས་པའི་སྒྲིབ་པ་དང་། མུན་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་ལ་བརྩོན་པ།
en: “Noble one, I know only this bodhisattva liberation called the origin of the roots of merit that inspire, in accordance with their dispositions, the ripening of all beings

source: ཆོས་ཐམས་ཅད་རབ་ཏུ་དཔྱད་པས་མངོན་པར་བསྒྲུབ་པ་ལ་མཁས་པ། བདག་མྱེད་པའི་ཆོས་མངོན་ཏུ་གྱུར་པ། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བ་རྒྱུན་མྱི་གཅོད་པ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་གཉིས་སུ་མྱེད་པར་རབ་ཏུ་རྟོགས་པ་དག་གི་ལམ་གྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འབྲང་བའི་བློ་དང་ལྡན་པ། དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་རྒྱ་མཚོ་ལ་འཇུག་པའམ། ཡེ་ཤེས་ཀྱི་རྣམ་པར་གནོན་པ་ཡོངས་སུ་ཤེས་པར་བྱ་བའམ།
en: How could I know the conduct, or comprehend the ocean of qualities, or understand the prowess of the knowledge, or ascertain the states of mind, or realize the power of samādhi, or know completely the miraculous manifestation of the liberations of bodhisattvas who have transcended all the existences in worlds, who appear in the visual form of all births in worlds, who have transcended all worldly knowledge, who are dedicated to destroying the mountain of all obscurations of knowledge, who have discerned the nature and characteristics of all phenomena, who are dedicated to eliminating all the obscurations and darkness of the kleśas, who are skilled in the accomplishment of the analysis of all phenomena, who have the direct perception of the Dharma of there being no self, who are continuously ripening and guiding beings, who have realized the way of nonduality of the realm of the Dharma, and who have the intelligence to follow the ocean of all the ways within the scope of speech?

source: སེམས་ཀྱི་གནས་ཁོང་དུ་ཆུད་པར་བྱ་བའམ། ཏིང་ངེ་འཛིན་ལ་དབང་བསྒྱུར་བ་རྟོགས་པར་བྱ་བའམ། རྣམ་པར་ཐར་པས་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་ཤེས་པར་བྱ་བར་ནུས་རེ་སྐན།
en: “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་འཛམ་བུའི་གླིང་འདི་ཉིད་ཀྱི་ལུམ་བི་ནིའི་ནགས་ཚལ་ན། ལུམ་བི་ནིའི་ནགས་ཚལ་གྱི་ལྷ་མོ་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་བཟང་པོས་དགའ་བའི་དཔལ་ཞེས་བྱ་བ་འདུག་གིས།
en: In the forest of Lumbinī in this Jambudvīpa, there is the goddess of the Lumbinī Forest called Sutejomaṇḍala­rati­śrī.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་བྱུང་བ་ཡིན་པ་དང་། ཇི་ལྟར་ན་འཇིག་རྟེན་རྣམས་ལ་སྣང་བར་བྱེད་པར་འགྱུར་བ་དང་། ཇི་ལྟར་ན་ཕྱི་མའི་མཐའི་བསྐལ་པའི་མུར་ཐུག་པར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་པས་མྱི་སྐྱོ་བར་འགྱུར་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཚན་མོའི་ལྷ་མོ་འགྲོ་བ་ཐམས་ཅད་བསྲུང་བའི་སྨོན་ལམ་ལ་བརྩོན་པའི་འོད་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Go to her and ask her, ‘How are bodhisattvas born into the family of the tathāgatas? How do bodhisattvas appear in the world? How do they unwearyingly practice bodhisattva conduct until the last of all future kalpas?’

source: མཚན་མོའི་ལྷ་མོ་འགྲོ་བ་ཐམས་ཅད་བསྲུང་བའི་སྨོན་ལམ་ལ་བརྩོན་པའི་འོད་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཐལ་མོ་སྦྱར་ཏེ་ཕྱིར་ལྟ་ཞིང་མཚན་མོའི་ལྷ་མོ་འགྲོ་བ་ཐམས་ཅད་བསྲུང་བའི་སྨོན་ལམ་ལ་བརྩོན་པའི་འོད་ཀྱི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ།
en: Sudhana, the head merchant’s son, bowed his head to the two feet of the night goddess Sarva­jagad­rakṣā­praṇidhāna­vīrya­prabhā, circumambulated the night goddess Sarva­jagad­rakṣā­praṇidhāna­vīrya­prabhā many hundreds of thousands of times, keeping her to his right, and, with palms together, looking back at her, departed from the night goddess Sarva­jagad­rakṣā­praṇidhāna­vīrya­prabhā.

source: བམ་པོ་བཅུ་གསུམ་པ།
en: Sutejomaṇḍala­rati­śrī

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཚན་མོའི་ལྷ་མོ་འགྲོ་བ་ཐམས་ཅད་བསྲུང་བའི་སྨོན་ལམ་ལ་བརྩོན་པའི་འོད་ཀྱི་གདམས་ངག་དེ་རྗེས་སུ་དྲན་པར་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བས་བསམ་པ་ཅི་ལྟ་བ་བཞིན་དུ་དགེ་བའི་རྩ་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་དེ་ལ་ཡོངས་སུ་བསྒོམ་པ་དང་། ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། རྒྱ་ཆེར་བྱེད་ཅིང་མཐར་གྱིས་ལུམ་བི་ནིའི་ནགས་ཚལ་གང་ན་བ་དེར་ཕྱིན་ཏེ།
en: Then Sudhana, the head merchant’s son, remembering the instruction of the night goddess Sarva­jagad­rakṣā­praṇidhāna­vīrya­prabhā and meditating on, comprehending, and augmenting the bodhisattva liberation called the origin of the roots of merit that inspire the ripening of all beings , eventually arrived at the Lumbinī Forest.

source: ལུམ་པི་ནིའི་ནགས་ཚལ་ལ་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ལུམ་བི་ནིའི་ནགས་ཚལ་གྱི་ལྷ་མོ་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་བཟང་པོས་དགའ་བའི་དཔལ་ཡོངས་སུ་ཚོལ་ཚོལ་བ་ལས།
en: He circumambulated the Lumbinī Forest, keeping it to his right, and then searched for Sutejomaṇḍala­rati­śrī, the Lumbinī Forest goddess.

source: ལུམ་བི་ནིའི་ནགས་ཚལ་གྱི་ལྷ་མོ་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་བཟང་པོས་དགའ་བའི་དཔལ་ལུམ་བི་ནིའི་ནགས་ཚལ་ན་རིན་པོ་ཆེའི་ཤིང་གི་ཡལ་ག་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་གྱི་ཁྱིམ་བརྩེགས་པ་ཞིག་ན།
en: He saw Sutejomaṇḍala­rati­śrī, the Lumbinī Forest goddess, in the Lumbinī Forest inside a kūṭāgāra made by the encircling of all branches of trees made of all precious materials.

source: སེངྒེའི་ཁྲི་རིན་པོ་ཆེའི་པདྨོའི་སྙིང་པོ་ཅན་ཞིག་ལ་འདུག་ཅིང་། ནགས་ཚལ་གྱི་ལྷ་མོ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་ཉི་ཤུའི་འཁོར་གྱིས་ཀུན་ནས་བསྐོར་ཏེ། མདུན་དུ་བྱས་ནས་ཆོས་བསྟན་ཏེ།
en: She was seated upon a precious lion throne with a lotus in its center and accompanied by an assembly of two hundred thousand trillion forest goddesses, seated before her and to whom she taught the Dharma.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྐྱེ་བ་རྒྱ་མཚོ་ཤིན་ཏུ་བསྟན་པ་ཞེས་བྱ་བའི་མདོ་སྡེ་ཡོངས་སུ་སྟོན་ཅིང་དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱི་རྒྱུད་དུ་རིགས་དང་ལྡན་པར་སྐྱེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡོན་ཏན་རྒྱ་མཚོའི་ཤུགས་རྣམ་པར་འཕེལ་བར་བྱེད་ཅིང་འདུག་པ་མཐོང་ནས། ལུམ་པི་ནིའི་ནགས་ཚལ་གྱི་ལྷ་མོ་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་བཟང་པོས་དགའ་བའི་དཔལ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: She was teaching them a sūtra called The Teaching of the Ocean of Lifetimes of All Bodhisattvas . She was increasing the power of the ocean of qualities of bodhisattvas who had been born into the family of the tathāgatas.

source: ལུམ་པི་ནིའི་ནགས་ཚལ་གྱི་ལྷ་མོ་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་བཟང་པོས་དགའ་བའི་དཔལ་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། མདུན་དུ་འདུག་སྟེ་ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་བྱུང་བ་ལགས་པའང་མ་འཚལ། ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སྤྱོད་པ་ལ་སྤྱོད་ཅིང་སེམས་ཅན་རྣམས་ལ་སྣང་བ་འབྱིན་པར་འགྱུར་བ་ཡང་མ་འཚལ་ཏོ།
en: He approached the Lumbinī Forest goddess Sutejomaṇḍala­rati­śrī, bowed down to the feet of the Lumbinī Forest goddess Sutejomaṇḍala­rati­śrī, and, standing before her with palms together, said, “Āryā, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas are born into the tathāgata family and how in practicing bodhisattva conduct they bring light to beings.”

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ལུམ་བི་ནིའི་ནགས་ཚལ་གྱི་ལྷ་མོ་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་བཟང་པོས་དགའ་བའི་དཔལ་གྱིས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་བཅུ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྐྱེ་བ་སྟེ། དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་སྐྱེས་པ་ཡིན་ནོ།
en: The Lumbinī Forest goddess Sutejomaṇḍala­rati­śrī said, “Noble one, if the bodhisattvas possess these ten kinds of birth, they are born into the family of the tathāgatas.

source: །དེ་དག་ལས་བྱུང་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལའང་བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བས་རྣམ་པར་འཕེལ་བར་འགྱུར་ཏེ། ཐོགས་པ་མྱེད་པ་དང་ཞུམ་པ་མེད་པ་དང་། ཕྱིར་ལྡོག་པ་མེད་པ་དང་། རྒྱུན་གཅོད་པ་མྱེད་པ་དང་། ཡོངས་སུ་སྐྱོ་བ་མེད་པ་དང་། སྒྱིད་ལུག་པར་འགྱུར་བ་མེད་པ་དང་། ཉམས་པར་འགྱུར་བ་མེད་པ་དང་། ཉམས་དམའ་བར་འགྱུར་བ་མེད་པ་དང་། ཡོངས་སུ་ཡི་འཆད་པར་འགྱུར་བ་མེད་པ་དང་། ཆུད་ཟ་བར་འགྱུར་བ་མྱེད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕྱོགས་ཀྱི་རྗེས་སུ་འབྲང་བར་འགྱུར་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་ལ་ཡོངས་སུ་གཞོལ་བར་འགྱུར་བ་དང་། སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨྱིན་པ་འཐོབ་པར་འགྱུར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སེམས་བསྐྱེད་པ་ཤིན་ཏུ་ཡངས་པར་འགྱུར་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་འཕེལ་བར་འགྱུར་བ་དང་། འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་ལས་རྣམ་པར་ལྡོག་པར་འགྱུར་བ་དང་། དེ་བཞིན་གཤེགས་པའི་སར་ཡོངས་སུ་གྲུབ་པར་འགྱུར་བ་དང་། ཡེ་ཤེས་ཀྱིས་མངོན་པར་ཤེས་པ་ཤིན་ཏུ་བྱང་བར་འགྱུར་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མངོན་དུ་འགྱུར་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡུལ་གྱི་དོན་དང་ལྡན་པར་འགྱུར་བའོ།
en: The bodhisattvas who originate from them in every instant of mind increase the roots of merit of a bodhisattva, are unimpeded, are not disheartened, do not regress, are not interrupted, are not dismayed, are not discouraged, do not deteriorate, do not become confused, do not become downcast, and do not come to ruin. They follow the direction of omniscience, they are dedicated to the ways of the realm of the Dharma, they attain ripening for the enlightenment of buddhahood, they have a vast development of the bodhisattva’s aspiration for enlightenment, they increase all the perfections, they turn away from all worldly existences, they accomplish the level of the tathāgatas, they purify the higher cognition of knowledge, they directly perceive the qualities of buddhahood, and they possess the meaning of the range of omniscience.

source: སངས་རྒྱས་ཐམས་ཅད་ལ་བསྙེན་བཀུར་བའི་སྨོན་ལམ་གྱིས་སྦྱོར་བའི་སྙིང་པོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་དང་པོའོ།
en: The first birth of a bodhisattva is called the essence of dedication to the prayer to serve all buddhas

source: །བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཡན་ལག་ཡོངས་སུ་འགྲུབ་པར་འགྱུར་བ་འབྱུང་བའི་སྙིང་པོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་གཉིས་པའོ།
en: “The second birth of a bodhisattva is called the essence of the origin of the attainment of the aspects of the aspiration to enlightenment

source: །ཆོས་ཀྱི་ཚུལ་ལ་ངེས་པར་རྟོགས་པར་གཞག་པའི་སྦྱོར་བའི་ཚུལ་མངོན་དུ་གྱུར་པ་འབྱུང་བའི་སྙིང་པོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་གསུམ་པའོ།
en: “The third birth of a bodhisattva is called the essence of the origin of the perception that is established in certainty in the ways of the Dharma

source: །དུས་གསུམ་སྣང་བར་བྱ་བའི་ལྷག་པའི་བསམ་པ་རྣམ་པར་དག་པའི་སྙིང་པོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་བཞི་པའོ།
en: “The fourth birth of a bodhisattva is called the essence of the pure, superior motivation that illuminates the three times

source: །ཀུན་ནས་སྣང་བའི་འོད་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་ལྔ་པའོ།
en: “The fifth birth of a bodhisattva is called the essence of all-illuminating light

source: །དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱི་རྒྱུད་དུ་འབྱུང་བའི་སྙིང་པོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་དྲུག་པའོ།
en: “The sixth birth of a bodhisattva is called the essence of the origin of the lineage of the tathāgata family

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྟོབས་ཀྱི་འོད་སྣང་བའི་རྒྱན་གྱི་སྙིང་པོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་བདུན་པའོ།
en: “The seventh birth of a bodhisattva is called the essence of the adorning light that illuminates the strengths of the buddhas

source: །ཡེ་ཤེས་ཀྱི་སྒོ་ཀུན་ནས་རྣམ་པར་དཔྱད་པས་ཡོངས་སུ་འགྲུབ་པ་འབྱུང་བའི་སྙིང་པོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་བརྒྱད་པའོ།
en: “The eighth birth of a bodhisattva is called the essence of the origin of the accomplishment through the complete analysis of the entrances into knowledge

source: །ཆོས་ཀྱི་དབྱིངས་སྤྲུལ་པས་བརྒྱན་པར་བྱེད་པའི་སྙིང་པོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་དགུ་པའོ།
en: “The ninth birth of a bodhisattva is called the essence of the display of emanations throughout the realm of phenomena

source: །དེ་བཞིན་གཤེགས་པའི་ས་ཡོངས་སུ་གནོན་པའི་ཤུགས་དྲག་པོའི་སྙིང་པོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་བཅུ་པའོ།
en: “The tenth birth of a bodhisattva is called the essence of the power of ascending to the level of the tathāgatas

source: །རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་དང་པོ་སངས་རྒྱས་ཐམས་ཅད་ལ་བསྙེན་བཀུར་བའི་སྨོན་ལམ་གྱི་སྦྱོར་བའི་སྙིང་པོ་ཞེས་བྱ་བ་གང་ཞེ་ན།
en: “Noble one, what is the first birth of a bodhisattva, called the essence of dedication to the prayer to serve all buddhas

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཐོག་མར་སངས་རྒྱས་མཆོད་ཅིང་རིམ་གྲོར་བྱ་བ་ལ་འཇུག་སྟེ།
en: It is when the bodhisattva first engages in serving and making offerings to the buddhas;

source: དེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། བསྟི་སྟང་དང་། མཆོད་པ་བྱེད་ཅིང་བསྙེན་བཀུར་བྱེད་དོ། །དགྱེས་པར་བྱེད་ལ་ཐུགས་བྱུང་པར་མི་བྱེད་པས།
en: venerating, worshiping, honoring, offering, serving, pleasing, and never displeasing the buddha bhagavats;

source: དེ་བཞིན་གཤེགས་པའི་ཞལ་བལྟ་བས་མི་ངོམས་པ་སངས་རྒྱས་ལ་རིམ་གྲོར་བྱ་བར་བརྩོན་པ་སངས་རྒྱས་ལ་དགའ་བའི་ཤུགས་ཀྱིས་རྣམ་པར་སྤེལ་བའི་ཤུགས་དང་ལྡན་པ།
en: never having enough of gazing upon the face of a tathāgata; being dedicated to venerating the buddhas; having increasing power through the power of delight in the buddhas;

source: དེ་བཞིན་གཤེགས་པ་མཐོང་བས་མོས་པའི་ཤུགས་དྲག་པོ་ཡོངས་སུ་སྐྱེས་པ།
en: giving rise to a powerful adoration on seeing the tathāgatas;

source: དེ་ཕྱིར་མི་ལྡོག་པའི་དད་པས་བསོད་ནམས་ཡོངས་སུ་སྡུད་པའི་ཚེ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་པའི་ཚོགས་ཡོངས་སུ་བསྡུ་བ་ལ་བརྩོན་ཞིང་སྦྱོར་བ་རྒྱུན་མི་གཅོད་པ་ཡིན་ཏེ།
en: and while accumulating merit with irreversible faith, uninterruptedly dedicating to completing an accumulation of offerings to all the tathāgatas.

source: རིགས་ཀྱི་བུ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྐྱེ་བ་དང་པོ། སངས་རྒྱས་ཐམས་ཅད་ལ་བསྙེན་བཀུར་བའི་སྨོན་ལམ་གྱི་སྦྱོར་བའི་སྙིང་པོ་ཞེས་བྱ་བ་སྟེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་དགེ་བའི་རྩ་བ་ཡོངས་སུ་འགྲུབ་པ་ཡང་དག་པར་སྡུད་པར་འགྱུར་བའོ།
en: “Noble one, that is the first birth of a bodhisattva, called the essence of dedication to the prayer to serve all buddhas , which acquires the accumulation of the roots of merit for omniscience.

source: །རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་གཉིས་པ། བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཡན་ལག་ཡོངས་སུ་གྲུབ་པར་འགྱུར་བ་འབྱུང་བའི་སྙིང་པོ་ཞེས་བྱ་བ་གང་ཞེ་ན། རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: “Noble one, what is the second birth of a bodhisattva, called the essence of the origin of the attainment of the aspects of the aspiration to enlightenment

source: འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་ཕྱིར་སྙིང་རྗེ་ཆེན་པོའི་སེམས་དང་། ཤིན་ཏུ་དགྱེས་པར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཐམས་ཅད་བསྙེན་བཀུར་བའི་སེམས་དང་། དངོས་པོ་ཐམས་ཅད་ལ་ཕོངས་པར་མྱི་བརྩི་བའི་ཕྱིར། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་བཙལ་བའི་སེམས་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་མངོན་དུ་འགྱུར་བར་བྱ་བའི་ཕྱིར། བཤམ་པ་ཆེན་པོའི་སེམས་དང་། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བའི་སྦྱོར་བས་རྒྱས་པར་དགང་བའི་ཕྱིར་བྱམས་པ་ཆེན་པོའི་སེམས་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གོ་ཅ་བརྟན་པར་བྱ་བའི་ཕྱིར་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་མྱི་གཏོང་བའི་སེམས་དང་། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་པའི་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་གཡོ་དང་སྒྱུ་མེད་པའི་སེམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལམ་ལ་ནན་ཏན་དུ་བྱ་བའི་ཕྱིར་ཁ་འོག་ཏུ་ལུས་ཁྲུས་པའི་སེམས་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་དང་། མི་འགལ་བར་བྱ་བའི་ཕྱིར། སངས་རྒྱས་ཐམས་ཅད་ལ་སྐུ་བསླུ་བ་མེད་པའི་སེམས་དང་། ཕྱི་མའི་མཐའི་མུར་ཐུག་པར་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བ་རྒྱུན་མི་གཅད་པའི་ཕྱིར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སྨོན་ལམ་ཆེན་པོ་འདེབས་པའི་སེམས་དང་། དེ་དག་ལ་སྩོགས་པ་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཡན་ལག་གི་ཚོགས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཡོངས་སུ་རྫོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་སྐྱེས་པ་ཡིན་ཏེ།
en: “Noble one, it is when the bodhisattva develops the aspiration for the highest, complete enlightenment and in that way has the motivation of great compassion for protecting all beings, has the motivation to serve all the buddhas in order to please them, has the motivation to seek for all the Dharmas of the buddhas in order to be indifferent toward all things, has the motivation of the great setting forth in order to perceive omniscience, has the motivation of great love in order to increase application to gathering all beings, has the motivation to never abandon all beings in order to have the strong armor of omniscience, has a motivation free of deception and dissimulation in order to attain the illumination of genuine knowledge, has the motivation to act in accord with what one teaches in order to practice the path of the bodhisattvas, has the motivation to never break one’s word to all the buddhas in order not to run counter to the prayers of all the tathāgatas, and has the motivation to make the great prayer for omniscience in order to continuously ripen and guide all beings until the end of future time. “Through completing the accumulation of these and other aspects of the aspiration to enlightenment, which are as numerous as the atoms in a buddha realm, a bodhisattva is born into the family of the tathāgatas.

source: རིགས་ཀྱི་བུ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་གཉིས་པ། བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཡན་ལག་ཡོངས་སུ་འགྲུབ་པར་འགྱུར་བ་འབྱུང་བའི་སྙིང་པོ་ཞེས་བྱ་བའོ།
en: “Noble one, that is the second birth of a bodhisattva, called the essence of the origin of the attainment of the aspects of the aspiration to enlightenment

source: །རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་གསུམ་པ་ཆོས་ཀྱི་ཚུལ་ལ་ངེས་པར་གཞག་པའི་སྦྱོར་བའི་ཚུལ་མངོན་དུ་གྱུར་པ་འབྱུང་བའི་སྙིང་པོ་ཞེས་བྱ་བ་གང་ཞེ་ན།
en: “Noble one, what is the third birth of bodhisattvas, called the essence of the origin of the perception that is established in certainty in the ways of the Dharma

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་རྒྱ་མཚོ་ཡོད་དོ་ཅོག་ངེས་པར་རྟོགས་པས་མངོན་དུ་བྱ་བའི་སེམས་དང་ལྡན་པ་ཐམས་ཅད་མཁྱེན་པའི་ལམ་གྱི་རྣམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བས་མངོན་དུ་བྱ་བར་གཅིག་ཏུ་སེམས་པའི་སེམས་དང་ལྡན་པ།
en: “Noble one, it is when a bodhisattva has a mind focused on understanding the entire ocean of the ways of the Dharma; has a mind single-pointedly focused on fulfilling the aspects of the path to omniscience;

source: ཁ་ན་མ་ཐོ་བ་མེད་པའི་ལས་ལ་ཡང་དག་པར་སྤྱད་པར་སེམས་པའི་སེམས་དང་ལྡན་པ།
en: has a mind with the intention to accomplish actions that are without fault;

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བ་མངོན་དུ་བྱ་བའི་སེམས་དང་ལྡན་པ་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ཐམས་ཅད་ལ་ནན་ཏན་དུ་བྱ་བས་ཡོངས་སུ་གྲུབ་པར་བྱ་བའི་སེམས་དང་ལྡན་པ།
en: has a mind focused on purifying the entire ocean of the ways of bodhisattva samādhis; has a mind that completes the attainment of bodhisattva qualities;

source: བྱང་ཆུབ་སེམས་དཔའི་ལམ་གྱི་རྒྱན་ཐམས་ཅད་མངོན་པར་བསྒྲུབ་པའི་སེམས་དང་ལྡན་པ།
en: has a mind that attains the display of all the aspects of the bodhisattva path;

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་དམྱིགས་པའི་ཚོགས་རྒྱ་ཆེན་པོ་ཡོངས་སུ་བསྒྲུབ་པ་བསྐལ་པའི་མྱེ་འབར་བས་ཀྱང་། རྒྱུན་མི་གཅད་པར་བརྩོན་པར་བྱ་བའི་སེམས་དང་ལྡན་པ།
en: has a mind that has continuous diligence, like the fire that burns at the end of a kalpa, in attaining the vast accumulation focused on omniscience;

source: འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བ་ལ་རབ་ཏུ་ཞུགས་པས། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཀུན་ཏུ་བཟང་པོ་མངོན་པར་བསྒྲུབ་པའི་སེམས་དང་ལྡན་པ།
en: has a mind that accomplishes the completely good bodhisattva conduct that is engaged in ripening and guiding all beings;

source: ཡོངས་སུ་སྤྱོད་པའི་ཚུལ་ཐམས་ཅད་ལ་རབ་ཏུ་ཞུགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་དངོས་པོ་ཐམས་ཅད་རྣམ་པར་བསྒོམ་པས་དངོས་པོ་མྱེད་པའི་ཚུལ་ལ་ཞུགས་པའི་སེམས་དང་ལྡན་པ་ཡིན་ཏེ།
en: and has a mind that enters into the ways of the nonexistence of things through meditation on all things in completing the qualities of a bodhisattva and engaging in all the ways of conduct.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་གསུམ་པ་ཆོས་ཀྱི་ཚུལ་ལ་ངེས་པར་རྟོགས་པས་གཞག་པའི་སྦྱོར་བའི་ཚུལ་མངོན་དུ་གྱུར་བ་འབྱུང་བའི་སྙིང་པོ་ཞེས་བྱ་བའོ།
en: “Noble one, that is the third birth of bodhisattvas, called the essence of the origin of the perception that is established in certainty in the ways of the Dharma

source: །རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་བཞི་པ་དུས་གསུམ་སྣང་བར་བྱ་བའི་ལྷག་པའི་བསམ་པ་རྣམ་པར་དག་པའི་སྙིང་པོ་ཞེས་བྱ་བ་གང་ཞེ་ན།
en: “Noble one, what is the fourth birth of a bodhisattva, called the essence of the pure, superior motivation that illuminates the three times

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་བསམ་པའི་དབྱིངས་ལ་གྱ་ནོམ་པར་ཡོངས་སུ་དག་པ་ཡིན། སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལ་སྣང་བ་རབ་ཏུ་ཐོབ་པ་ཡིན།
en: “Noble one, it is when a bodhisattva has purified the element of excellent, superior motivation;
